#!/bin/bash
if [ "$#" -ne 2 ];then
  echo "只支持两个参数计算"
  exit 1
elif ! [[ "$1" =~ ^[0-9.0-9]+$ ]] || ! [[ "$2" =~ ^[0-9.0-9]+$ ]];then

  if ! [[ "$1" =~ ^[0-9.0-9]+$ ]];then
    echo "请输入纯数字类型计算, '$1' 不符合条件"
  fi

  if ! [[ "$2" =~ ^[0-9.0-9]+$ ]];then
    echo "请输入纯数字类型计算, '$2' 不符合规则"
  fi  

  exit 1;else
  echo "( $1 ) 加 ( $2 ) 等于：$(echo  "$1  +  $2" | bc -l)"
  echo "( $1 ) 减 ( $2 ) 等于：$(echo  "$1  -  $2" | bc -l)"
  echo "( $1 ) 乘 ( $2 ) 等于：$(echo  "$1  *  $2" | bc -l)"
  echo "( $1 ) 除 ( $2 ) 等于：$(echo  "scale=2; $1  /  $2" | bc -l)"
fi  


#if ! [[ "$1" =~ ^[0-9.0-9]+$ ]] || ! [[ "$2" =~ ^[0-9.0-9]+$ ]];then
#  echo "请输入纯数字类型计算"
#  exit 1;
#elif [ "$#" -ne 2 ];then
#  echo "只支持两个参数计算"
#  exit 1;else
#  echo "( $1 ) 加 ( $2 ) 等于：$(echo  "$1  +  $2" | bc -l)"
#  echo "( $1 ) 减 ( $2 ) 等于：$(echo  "$1  -  $2" | bc -l)"
#  echo "( $1 ) 乘 ( $2 ) 等于：$(echo  "$1  *  $2" | bc -l)"
#  echo "( $1 ) 除 ( $2 ) 等于：$(echo  "scale=2; $1  /  $2" | bc -l)"
#fi
